backend/app/controllers/api/v1/todos_controller.rb

  def index
    @todos = Todo.order(created_at: :desc)

    # Filter by status
    @todos = case params[:status]
    when 'completed'
      @todos.completed
    when 'pending'
      @todos.pending
    else
      @todos
    end

    # Pagination
    @todos = @todos.page(params[:page]).per(per_page) # Requires kaminari gem
---
SELECT "todos".* FROM "todos" WHERE "todos"."completed" = $1 ORDER BY "todos"."created_at" DESC LIMIT $2 OFFSET $3  [["completed", false], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "todos" WHERE "todos"."completed" = $1  [["completed", false]]

  def create
    @todo = Todo.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("title", "description", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New Task"], ["description", "Description"], ["completed", nil], ["created_at", "2024-12-13 06:08:48.210326"], ["updated_at", "2024-12-13 06:08:48.210326"]]

  def toggle_complete
    @todo.update(completed: !@todo.completed)
---
UPDATE "todos" SET "completed" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["completed", true], ["updated_at", "2024-12-13 06:14:01.496696"], ["id", 1]]